workstation/tutorials/lagrangian/reactingParcelFoam/hotBoxes/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

# create the underlying block mesh
runApplication blockMesh

# create the set for the obstacles
runApplication topoSet

# create the obstacles - add obstacle patches to wallFilm patch
runApplication subsetMesh c0 -patch wallFilm -overwrite

# split the obstacle patches into cube[1-6]_patch[1-6]
runApplication ./patchifyObstacles

# Create the wall film region via extrusion
runApplication extrudeToRegionMesh -overwrite

# Fine tuning of U and T boundary conditions
runApplication changeDictionary

# Copy the system settings over to the wall film region
rm -rf system/wallFilmRegion
cp -r system/wallFilmRegion.orig system/wallFilmRegion

find ./0 -maxdepth 1 -type f -exec \
    sed -i -e "s/wallFilm/\"(region0_to.*)\"/g" {} \;

#------------------------------------------------------------------------------
